; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob41) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate3)
	(at pallet1 depot1)
	(clear crate2)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate12)
	(at pallet6 distributor1)
	(clear crate11)
	(at pallet7 depot2)
	(clear pallet7)
	(at pallet8 depot1)
	(clear pallet8)
	(at pallet9 depot2)
	(clear crate7)
	(at pallet10 distributor2)
	(clear crate8)
	(at pallet11 distributor0)
	(clear crate5)
	(at pallet12 depot1)
	(clear crate10)
	(at pallet13 distributor0)
	(clear pallet13)
	(at truck0 distributor0)
	(at truck1 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor0)
	(on crate0 pallet11)
	(at crate1 distributor1)
	(on crate1 pallet6)
	(at crate2 depot1)
	(on crate2 pallet1)
	(at crate3 depot0)
	(on crate3 pallet0)
	(at crate4 distributor2)
	(on crate4 pallet5)
	(at crate5 distributor0)
	(on crate5 crate0)
	(at crate6 depot2)
	(on crate6 pallet9)
	(at crate7 depot2)
	(on crate7 crate6)
	(at crate8 distributor2)
	(on crate8 pallet10)
	(at crate9 depot1)
	(on crate9 pallet12)
	(at crate10 depot1)
	(on crate10 crate9)
	(at crate11 distributor1)
	(on crate11 crate1)
	(at crate12 distributor2)
	(on crate12 crate4)
)

(:goal (and
		(on crate0 pallet3)
		(on crate1 pallet6)
		(on crate2 crate10)
		(on crate4 crate11)
		(on crate5 crate1)
		(on crate6 crate4)
		(on crate8 crate2)
		(on crate9 pallet7)
		(on crate10 pallet11)
		(on crate11 pallet4)
		(on crate12 pallet2)
	)
))

; plan
1. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 1 of 11
2. (lift hoist5 crate12 crate4 distributor2)
   deleted: (at crate12 distributor2) (clear crate12) (available hoist5) (on crate12 crate4)
   added: (lifting hoist5 crate12) (clear crate4)
   goals met: 1 of 11
3. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 1 of 11
4. (load hoist5 crate12 truck1 distributor2)
   deleted: (lifting hoist5 crate12)
   added: (in crate12 truck1) (available hoist5)
   goals met: 1 of 11
5. (lift hoist3 crate5 crate0 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist3) (on crate5 crate0)
   added: (lifting hoist3 crate5) (clear crate0)
   goals met: 1 of 11
6. (load hoist3 crate5 truck0 distributor0)
   deleted: (lifting hoist3 crate5)
   added: (in crate5 truck0) (available hoist3)
   goals met: 1 of 11
7. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 1 of 11
8. (lift hoist3 crate0 pallet11 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 pallet11)
   added: (lifting hoist3 crate0) (clear pallet11)
   goals met: 1 of 11
9. (drop hoist3 crate0 pallet3 distributor0)
   deleted: (lifting hoist3 crate0) (clear pallet3)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 pallet3)
   goals met: 2 of 11
10. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 2 of 11
11. (lift hoist4 crate11 crate1 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist4) (on crate11 crate1)
   added: (lifting hoist4 crate11) (clear crate1)
   goals met: 2 of 11
12. (drop hoist4 crate11 pallet4 distributor1)
   deleted: (lifting hoist4 crate11) (clear pallet4)
   added: (available hoist4) (at crate11 distributor1) (clear crate11) (on crate11 pallet4)
   goals met: 3 of 11
13. (unload hoist4 crate5 truck0 distributor1)
   deleted: (in crate5 truck0) (available hoist4)
   added: (lifting hoist4 crate5)
   goals met: 3 of 11
14. (drop hoist4 crate5 crate1 distributor1)
   deleted: (lifting hoist4 crate5) (clear crate1)
   added: (available hoist4) (at crate5 distributor1) (clear crate5) (on crate5 crate1)
   goals met: 4 of 11
15. (lift hoist5 crate8 pallet10 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 pallet10)
   added: (lifting hoist5 crate8) (clear pallet10)
   goals met: 4 of 11
16. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 4 of 11
17. (load hoist5 crate8 truck1 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck1) (available hoist5)
   goals met: 4 of 11
18. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 4 of 11
19. (lift hoist5 crate4 pallet5 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist5) (on crate4 pallet5)
   added: (lifting hoist5 crate4) (clear pallet5)
   goals met: 4 of 11
20. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 4 of 11
21. (load hoist5 crate4 truck1 distributor2)
   deleted: (lifting hoist5 crate4)
   added: (in crate4 truck1) (available hoist5)
   goals met: 4 of 11
22. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 4 of 11
23. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 4 of 11
24. (unload hoist4 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist4)
   added: (lifting hoist4 crate4)
   goals met: 4 of 11
25. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 4 of 11
26. (drop hoist4 crate4 crate11 distributor1)
   deleted: (lifting hoist4 crate4) (clear crate11)
   added: (available hoist4) (at crate4 distributor1) (clear crate4) (on crate4 crate11)
   goals met: 5 of 11
27. (unload hoist1 crate8 truck1 depot1)
   deleted: (in crate8 truck1) (available hoist1)
   added: (lifting hoist1 crate8)
   goals met: 5 of 11
28. (drop hoist1 crate8 crate2 depot1)
   deleted: (lifting hoist1 crate8) (clear crate2)
   added: (available hoist1) (at crate8 depot1) (clear crate8) (on crate8 crate2)
   goals met: 6 of 11
29. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   goals met: 6 of 11
30. (unload hoist2 crate12 truck1 depot2)
   deleted: (in crate12 truck1) (available hoist2)
   added: (lifting hoist2 crate12)
   goals met: 6 of 11
31. (drop hoist2 crate12 pallet2 depot2)
   deleted: (lifting hoist2 crate12) (clear pallet2)
   added: (available hoist2) (at crate12 depot2) (clear crate12) (on crate12 pallet2)
   goals met: 7 of 11
32. (lift hoist2 crate7 crate6 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist2) (on crate7 crate6)
   added: (lifting hoist2 crate7) (clear crate6)
   goals met: 7 of 11
33. (load hoist2 crate7 truck1 depot2)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck1) (available hoist2)
   goals met: 7 of 11
34. (lift hoist2 crate6 pallet9 depot2)
   deleted: (at crate6 depot2) (clear crate6) (available hoist2) (on crate6 pallet9)
   added: (lifting hoist2 crate6) (clear pallet9)
   goals met: 7 of 11
35. (load hoist2 crate6 truck1 depot2)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   goals met: 7 of 11
36. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 7 of 11
37. (unload hoist4 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist4)
   added: (lifting hoist4 crate6)
   goals met: 7 of 11
38. (drop hoist4 crate6 crate4 distributor1)
   deleted: (lifting hoist4 crate6) (clear crate4)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 crate4)
   goals met: 8 of 11
39. (lift hoist1 crate10 crate9 depot1)
   deleted: (at crate10 depot1) (clear crate10) (available hoist1) (on crate10 crate9)
   added: (lifting hoist1 crate10) (clear crate9)
   goals met: 8 of 11
40. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 8 of 11
41. (load hoist1 crate10 truck0 depot1)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck0) (available hoist1)
   goals met: 8 of 11
42. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 8 of 11
43. (unload hoist3 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist3)
   added: (lifting hoist3 crate10)
   goals met: 8 of 11
44. (drop hoist3 crate10 pallet11 distributor0)
   deleted: (lifting hoist3 crate10) (clear pallet11)
   added: (available hoist3) (at crate10 distributor0) (clear crate10) (on crate10 pallet11)
   goals met: 9 of 11
45. (lift hoist1 crate9 pallet12 depot1)
   deleted: (at crate9 depot1) (clear crate9) (available hoist1) (on crate9 pallet12)
   added: (lifting hoist1 crate9) (clear pallet12)
   goals met: 9 of 11
46. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 9 of 11
47. (load hoist1 crate9 truck0 depot1)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   goals met: 9 of 11
48. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   goals met: 9 of 11
49. (unload hoist2 crate9 truck0 depot2)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   goals met: 9 of 11
50. (drop hoist2 crate9 pallet7 depot2)
   deleted: (lifting hoist2 crate9) (clear pallet7)
   added: (available hoist2) (at crate9 depot2) (clear crate9) (on crate9 pallet7)
   goals met: 10 of 11
51. (lift hoist1 crate8 crate2 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist1) (on crate8 crate2)
   added: (lifting hoist1 crate8) (clear crate2)
   goals met: 9 of 11
52. (drop hoist1 crate8 pallet12 depot1)
   deleted: (lifting hoist1 crate8) (clear pallet12)
   added: (available hoist1) (at crate8 depot1) (clear crate8) (on crate8 pallet12)
   goals met: 9 of 11
53. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist1) (on crate2 pallet1)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 9 of 11
54. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   goals met: 9 of 11
55. (load hoist1 crate2 truck0 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   goals met: 9 of 11
56. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 9 of 11
57. (unload hoist3 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist3)
   added: (lifting hoist3 crate2)
   goals met: 9 of 11
58. (drop hoist3 crate2 crate10 distributor0)
   deleted: (lifting hoist3 crate2) (clear crate10)
   added: (available hoist3) (at crate2 distributor0) (clear crate2) (on crate2 crate10)
   goals met: 10 of 11
59. (lift hoist1 crate8 pallet12 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist1) (on crate8 pallet12)
   added: (lifting hoist1 crate8) (clear pallet12)
   goals met: 10 of 11
60. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 10 of 11
61. (load hoist1 crate8 truck0 depot1)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   goals met: 10 of 11
62. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 10 of 11
63. (unload hoist3 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist3)
   added: (lifting hoist3 crate8)
   goals met: 10 of 11
64. (drop hoist3 crate8 crate2 distributor0)
   deleted: (lifting hoist3 crate8) (clear crate2)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 crate2)
   goals met: 11 of 11
